
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает вид номенклатуры по синониму
// Если значение не найдено, возвращается пустая ссылка
//
// Параметры:
//   Синоним - Строка - синоним, по которому происходит поиск
//
// Возвращаемое значение:
//   ПеречислениеСсылка.ВидыНоменклатуры
//
Функция ВидНоменклатурыПоСинониму(Синоним) Экспорт
	
	Результат = Перечисления.ВидыНоменклатуры.ПустаяСсылка();
	
	Для Каждого ЭлементПеречисления Из Метаданные.Перечисления.ВидыНоменклатуры.ЗначенияПеречисления Цикл
		
		Если ЭлементПеречисления.Синоним = Синоним Тогда
			Результат = Перечисления.ВидыНоменклатуры[ЭлементПеречисления.Имя];
			Прервать;
		КонецЕсли; 
		
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецЕсли
